In [1]:
import pandas as pd
%matplotlib inline
import matplotlib
import matplotlib.pyplot as plt
import numpy as np

ratings = pd.read_csv('C:/Users/User/Desktop/ml/ml-1m/ratings.dat',sep="::",names=['user_id', 'movie_id', 'rating', 'timestamp'])

# Reading users file
users = pd.read_csv('C:/Users/User/Desktop/ml/Users.csv',encoding='latin-1')

# Reading movies file
movies = pd.read_csv('C:/Users/User/Desktop/ml/ml-1m/movies.dat',sep="::",encoding='latin-1',names=['movie_id', 'title', 'genres'])

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  import sys
C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:13: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  del sys.path[0]

In [2]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [3]:
movies[movies.movie_id==5]['title'].to_string(index=False)

'Father of the Bride Part II (1995)'

In [4]:
movies.tail()

      movie_id                       title          genres
3878      3948     Meet the Parents (2000)          Comedy
3879      3949  Requiem for a Dream (2000)           Drama
3880      3950            Tigerland (2000)           Drama
3881      3951     Two Family House (2000)           Drama
3882      3952       Contender, The (2000)  Drama|Thriller

In [5]:
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [6]:
ratings.tail()

         user_id  movie_id  rating  timestamp
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

In [7]:

users.head()

,uid,fname,lname,pass,gender,age,occupation,zipcode,age_desc,occ_desc
0,1,John,Smith,PSvOAOsb,F,1,10,48067,Under 18,K-12 student
1,2,William,Johnson,7iisAnps,M,56,16,70072,56+,self-employed
2,3,James,Williams,LYGR0umy,M,25,15,55117,25-34,scientist
3,4,Charles,Brown,9AA3ln6S,M,45,7,02460,45-49,executive/managerial
4,5,George,Jones,9zOjWBzP,M,25,20,55455,25-34,writer

In [8]:
users.tail()

,uid,fname,lname,pass,gender,age,occupation,zipcode,age_desc,occ_desc
6035,6036,Alfred,Adrian,OJHF007p,F,25,15,32603,25-34,scientist
6036,6037,Howard,Flory,MtJXxN75,F,45,1,76006,45-49,academic/educator
6037,6038,Paul,Nestor,SINqONN9,F,56,1,14706,56+,academic/educator
6038,6039,Benjamin,Spell,TQqOk4Ku,F,45,0,01060,45-49,other or not specified
6039,6040,Frederick,Speight,8L8pDq3Y,M,25,6,11106,25-34,doctor/health care

In [9]:
from sklearn import cross_validation as cv
train_data, test_data = cv.train_test_split(ratings, test_size=0.25)

C:\Users\User\Anaconda3\lib\site-packages\sklearn\cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [10]:
n_users = ratings.user_id.unique().shape[0]
n_items = ratings.movie_id.unique().shape[0]
print(n_users)
print(n_items)

6040
3706

In [11]:
Ratings = ratings.pivot(index = 'user_id', columns ='movie_id', values = 'rating').fillna(0)
Ratings.head()

movie_id,1,2,3,4,5,6,7,8,9,10,...,3943,3944,3945,3946,3947,3948,3949,3950,3951,3952
user_id,,,,,,,,,,,,,,,,,,,,,
1,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [40]:
from scipy.sparse import csr_matrix
Rating_matrix = csr_matrix(Ratings.values)

from sklearn.neighbors import NearestNeighbors

model_knn = NearestNeighbors(metric = 'euclidean', algorithm = 'auto',n_neighbors=7)
model_knn.fit(Rating_matrix)

NearestNeighbors(algorithm='auto', leaf_size=30, metric='euclidean',
         metric_params=None, n_jobs=1, n_neighbors=7, p=2, radius=1.0)

In [43]:
#query_index = np.random.choice(Ratings.shape[0])
def neighbours(query_index):
    distances, indices = model_knn.kneighbors(Ratings.iloc[query_index, :].reshape(1, -1), n_neighbors = 7)
    k=[]
    d=[]
    for i in range(1, len(distances.flatten())):
        k.append(Ratings.index[indices.flatten()[i]])
        d.append((1/distances.flatten()[i]**2)*1000)
    return k,d

In [62]:
UID=1
neighbours(UID)

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: reshape is deprecated and will raise in a subsequent release. Please use .values.reshape(...) instead
  This is separate from the ipykernel package so we can avoid doing imports until

([2646, 5155, 1849, 2543, 1126, 3863],
 [0.56116722783389439,
  0.55679287305122493,
  0.55493895671476146,
  0.54884742041712398,
  0.54644808743169393,
  0.54318305268875622])

In [63]:
indices,distances  = neighbours(UID)
for i in range(len(indices)):
    print('{0}: {1}, have similarity {2}'.format(i+1, indices[i], distances[i]))

1: 2646, have similarity 0.5611672278338944
2: 5155, have similarity 0.5567928730512249
3: 1849, have similarity 0.5549389567147615
4: 2543, have similarity 0.548847420417124
5: 1126, have similarity 0.5464480874316939
6: 3863, have similarity 0.5431830526887562

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: reshape is deprecated and will raise in a subsequent release. Please use .values.reshape(...) instead
  This is separate from the ipykernel package so we can avoid doing imports until

In [64]:
def moviemeta(movieid):
    title=movies[movies.movie_id==movieid]['title'].to_string(index=False)
    return title

In [65]:
def favmovie(userId,N=20):
    userRatings= ratings[ratings['user_id']==userId]
    sortedRatings= pd.DataFrame.sort_values(userRatings,['rating'],ascending=[0])[:N]
    sortedRatings['title']= sortedRatings['movie_id'].apply(moviemeta)
    return sortedRatings

In [66]:
favmovie(UID,5)

,user_id,movie_id,rating,timestamp,title
0,1,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975)
46,1,1029,5,978302205,Dumbo (1941)
40,1,1,5,978824268,Toy Story (1995)
18,1,3105,5,978301713,Awakenings (1990)
41,1,1961,5,978301590,Rain Man (1988)

In [67]:
k,d=neighbours(UID)
for x in k:
    print('\nFor user ',x,'\n',favmovie(x,5)[['title','rating']])

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: reshape is deprecated and will raise in a subsequent release. Please use .values.reshape(...) instead
  This is separate from the ipykernel package so we can avoid doing imports until

For user  2646
                                                     title  rating
434194  Star Wars: Episode V - The Empire Strikes Back...       5
434190                               Patriot Games (1992)       5
434202                                    Rain Man (1988)       5
434201                   Shawshank Redemption, The (1994)       5
434198                                     Titanic (1997)       5

For user  5155
                                          title  rating
857769                       Braveheart (1995)       5
857772              Saving Private Ryan (1998)       4
857771         Thomas Crown Affair, The (1999)       4
857753  One Flew Over the Cuckoo's Nest (1975)       4
857758                  Friday the 13th (1980)       4

For user  1849
                                                    title  rating
310363                  Silence of the Lambs, The (1991)       5
310383                        Saving Private Ryan (1998)       5
310368  Star Wars: Episode I - The Phantom Menace (1999)       5
310369                              Fugitive, The (1993)       5
310378                                Matrix, The (1999)       5

For user  2543
                                          title  rating
420632        Silence of the Lambs, The (1991)       5
420640  One Flew Over the Cuckoo's Nest (1975)       5
420649            To Kill a Mockingbird (1962)       5
420648                 Schindler's List (1993)       5
420647                     Forrest Gump (1994)       5

For user  1126
                             title  rating
179913          Unforgiven (1992)       5
179924     Green Mile, The (1999)       5
179931    Schindler's List (1993)       5
179929  As Good As It Gets (1997)       5
179926          Braveheart (1995)       5

For user  3863
                                                     title  rating
642219                  Terminator 2: Judgment Day (1991)       5
642235                                 Matrix, The (1999)       5
642242  Star Wars: Episode VI - Return of the Jedi (1983)       5
642243                         Saving Private Ryan (1998)       5
642233                                Men in Black (1997)       4

In [68]:
def topN(user,N=3):
    k,d=neighbours(user)
    r=ratings.pivot(index = 'user_id', columns ='movie_id', values = 'rating')
    NNRatings=r[r.index.isin(k)]
    NNRatings=(NNRatings.T*d).T
    avgRating= NNRatings.apply(np.mean).dropna()
    movieSeen=r.transpose()[user].dropna().index
    topMovies=avgRating.sort_values(ascending=False).index[:N]
    return pd.Series(topMovies,np.mean(r)[topMovies]).apply(moviemeta).sort_index(ascending=False)

In [69]:
topN(UID,20)

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: reshape is deprecated and will raise in a subsequent release. Please use .values.reshape(...) instead
  This is separate from the ipykernel package so we can avoid doing imports until

4.554558                     Shawshank Redemption, The (1994)
4.510417                              Schindler's List (1993)
4.425647                         To Kill a Mockingbird (1962)
4.351823                     Silence of the Lambs, The (1991)
4.337354                           Saving Private Ryan (1998)
4.303710                           Princess Bride, The (1987)
4.292977    Star Wars: Episode V - The Empire Strikes Back...
4.247963                             Wizard of Oz, The (1939)
4.234957                                    Braveheart (1995)
4.176357                             Good Will Hunting (1997)
4.154664                               Green Mile, The (1999)
4.134357                          Grapes of Wrath, The (1940)
4.090271                                    Unforgiven (1992)
4.087967                                  Forrest Gump (1994)
4.022893    Star Wars: Episode VI - Return of the Jedi (1983)
3.950140                            As Good As It Gets (1997)
3.750000                                 Patriot Games (1992)
3.739953                                  Men in Black (1997)
3.641491                                  Pretty Woman (1990)
3.583441                                       Titanic (1997)
Name: movie_id, dtype: object